###############################################################################
# Created by write_sdc
###############################################################################
current_design counter32
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 8.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {count[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {count[31]}]
set_load -pin_load 0.0334 [get_ports {count[30]}]
set_load -pin_load 0.0334 [get_ports {count[29]}]
set_load -pin_load 0.0334 [get_ports {count[28]}]
set_load -pin_load 0.0334 [get_ports {count[27]}]
set_load -pin_load 0.0334 [get_ports {count[26]}]
set_load -pin_load 0.0334 [get_ports {count[25]}]
set_load -pin_load 0.0334 [get_ports {count[24]}]
set_load -pin_load 0.0334 [get_ports {count[23]}]
set_load -pin_load 0.0334 [get_ports {count[22]}]
set_load -pin_load 0.0334 [get_ports {count[21]}]
set_load -pin_load 0.0334 [get_ports {count[20]}]
set_load -pin_load 0.0334 [get_ports {count[19]}]
set_load -pin_load 0.0334 [get_ports {count[18]}]
set_load -pin_load 0.0334 [get_ports {count[17]}]
set_load -pin_load 0.0334 [get_ports {count[16]}]
set_load -pin_load 0.0334 [get_ports {count[15]}]
set_load -pin_load 0.0334 [get_ports {count[14]}]
set_load -pin_load 0.0334 [get_ports {count[13]}]
set_load -pin_load 0.0334 [get_ports {count[12]}]
set_load -pin_load 0.0334 [get_ports {count[11]}]
set_load -pin_load 0.0334 [get_ports {count[10]}]
set_load -pin_load 0.0334 [get_ports {count[9]}]
set_load -pin_load 0.0334 [get_ports {count[8]}]
set_load -pin_load 0.0334 [get_ports {count[7]}]
set_load -pin_load 0.0334 [get_ports {count[6]}]
set_load -pin_load 0.0334 [get_ports {count[5]}]
set_load -pin_load 0.0334 [get_ports {count[4]}]
set_load -pin_load 0.0334 [get_ports {count[3]}]
set_load -pin_load 0.0334 [get_ports {count[2]}]
set_load -pin_load 0.0334 [get_ports {count[1]}]
set_load -pin_load 0.0334 [get_ports {count[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
